---
kind: method
id: M:Autodesk.Revit.DB.Options.#ctor
source: html/3672ff61-28ce-c87e-2b79-6c3e736cba45.htm
---
# Autodesk.Revit.DB.Options.#ctor Method

Creates a default Options object.

## Syntax (C#)
```csharp
public Options()
```

## Remarks
Defaults to medium detail, no references and no view.